# DataFrame Data Structure
Week 2 Lec 2.1

In [7]:
import pandas as pd

import numpy as np

In [2]:
record1 = pd.Series({'Name':'Alice','Subject':'Physics','Score':'89'})

record2 = pd.Series({'Name':'Molly','Subject':'Biology','Score':'90'})

record3 = pd.Series({'Name':'Bhavarth','Subject':'Petroleum','Score':'86'})

#Just a normal Series type:object is being created

In [3]:
record1

Name         Alice
Subject    Physics
Score           89
dtype: object

In [5]:
#creating a DataFrame in python with 1 args - items in arrays & 2 args - index values we want to give

df = pd.DataFrame([record1, record2, record3], index=['School1', 'School2','School3'])

In [6]:
df

             Name    Subject Score
School1     Alice    Physics    89
School2     Molly    Biology    90
School3  Bhavarth  Petroleum    86

In [8]:
#just to see the headers of the data - the first 5 rows use head() func

df.head()

             Name    Subject Score
School1     Alice    Physics    89
School2     Molly    Biology    90
School3  Bhavarth  Petroleum    86

In [9]:
#another method --List of Dictionary--

students = [{'name':'alice','sub':'eng','score':'23'},{'name':'helen','sub':'chem','score':'21'},{'name':'smith','sub':'bio','score':'26'}]

df2 = pd.DataFrame(students)

In [10]:
df2

    name   sub score
0  alice   eng    23
1  helen  chem    21
2  smith   bio    26

In [11]:
#automatic indexed starting from ZERO

In [12]:
#.iloc -- Index  & .loc -- label for extracting
# single pass in above will give entire row

df.loc['School3']

Name        Bhavarth
Subject    Petroleum
Score             86
Name: School3, dtype: object

In [14]:
df.T #transpose column to rows and vice versa

         School1  School2    School3
Name       Alice    Molly   Bhavarth
Subject  Physics  Biology  Petroleum
Score         89       90         86

In [15]:
df

             Name    Subject Score
School1     Alice    Physics    89
School2     Molly    Biology    90
School3  Bhavarth  Petroleum    86

In [16]:
df3 = df.T

In [17]:
df3

         School1  School2    School3
Name       Alice    Molly   Bhavarth
Subject  Physics  Biology  Petroleum
Score         89       90         86

In [20]:
df['Name'] #to give column value DO NOT USE .LOC ATTRIBUTE WILL KEY KEY ERROR

School1       Alice
School2       Molly
School3    Bhavarth
Name: Name, dtype: object

In [22]:
#chaining to get just the required entry

df.loc['School1']['Name']

'Alice'

In [24]:
#type of the object

print(type(df.loc['School1']))
print(type(df.loc['School1']['Name']))

<class 'pandas.core.series.Series'>
<class 'str'>

In [25]:
#Slicing

df

             Name    Subject Score
School1     Alice    Physics    89
School2     Molly    Biology    90
School3  Bhavarth  Petroleum    86

In [26]:
df.loc[:,["Score","Name"]] #all rows using : --- and score and name column

        Score      Name
School1    89     Alice
School2    90     Molly
School3    86  Bhavarth

In [27]:
#to drop a column however .drop() doesn't update the dataframe & drops the row selected

df.drop("School2")

             Name    Subject Score
School1     Alice    Physics    89
School3  Bhavarth  Petroleum    86

In [29]:
#.drop 2 parameter -- 1. inplace to update the dataframe immediately 2. axes = 1 to drop the column by its label

dfc = df.copy()

dfc.drop("School1", inplace = True)

In [30]:
dfc

             Name    Subject Score
School2     Molly    Biology    90
School3  Bhavarth  Petroleum    86

In [43]:
#del deletes the column by its label -- also updates dataframe

dfc = df.copy()
dfc

             Name    Subject Score
School1     Alice    Physics    89
School2     Molly    Biology    90
School3  Bhavarth  Petroleum    86

In [44]:
del dfc["Name"]

dfc

           Subject Score
School1    Physics    89
School2    Biology    90
School3  Petroleum    86